[{"link":"https://www.modbee.com/news/local/article281504428.html#storylink=sectionheadlines","content":["\n             By Dominique Williams \n            \n        ","We all know them — the dreaded Modesto intersections that are backed up more often than not. Particularly, the ones near the Highway 99 on-ramps.","Driving in these intersections can be even more frustrating when you’re stuck behind a line of cars moving straight, when you need to turn right.","Modesto Bee reader Tom Meinhold asked Bee Curious, a community-driven series in which our journalists answer your questions, “When approaching an intersection that is backed up and you are going to make a right-hand turn, when can you enter the bike lane and approach the intersection and make your right-hand turn?”","We reached out to the Modesto Police Department to answer this, and asked whether you can be cited for traveling in a bike lane too early:","A bike lane is a designated traffic lane for bicyclists, according to the California Department of Motor Vehicles. There are some cases where motorists must merge into a bicycle lane, like when making a right turn.","These lanes are marked by a solid white line up until the 200-foot mark, said Sharon Bear, a spokeswoman with the Modesto Police Department. The line becomes dotted when it is legal to enter the lane.","“The driver can’t enter the bike lane when turning right until 200 feet before the turn,” Bear said. “If a bicyclist is using the bike lane, the bicyclist has the right of way and the driver must yield to the bicyclist.”","The white lines designating a bicycle lane are different from the white lines showing the edge of the road, according to the DMV. A bicycle lane follows specific width requirements and is “clearly marked” as a bike lane with symbols and/or signs.","Bicycle lanes are sometimes painted a bright green to increase visibility, according to the DMV. Drivers should treat these just like any other bicycle lane.","You cannot drive in a bike lane unless to park where permitted, to enter or leave the roadway, or to prepare for a turn within 200 feet of an intersection, according to Vehicle Code 21209.","If you enter the bike lane before the 200-foot mark or when otherwise not permitted, you could be fined roughly $230, Bear said.","What do you want to know about life in Modesto? Ask our service journalism team your top-of-mind questions in the module below or email servicejournalists@modbee.com.","This story was originally published November 7, 2023, 12:21 PM."]},{"link":"https://www.modbee.com/news/local/article281589583.html#storylink=sectionheadlines","content":["\n             By Dominique Williams \n            \n        ","“Lifelong memories are built” when you cut down your own Christmas tree, say recreation officials at Stanislaus National Forest, where Christmas tree permits will be available starting Thursday.","The permits are offered to the public for free (though there is a small processing fee) to help reduce hazardous fuel ladders that have built up over years of fire suppression, according to the forest’s permit page on Recreation.gov, an online reservation system.","“Begin the holiday season with an outing to cut the family tree,” the site says.","Here’s how you can get a permit, how many trees you can cut and where cutting is permitted:","This is the second year Stanislaus National Forest has allowed the public to cut Christmas trees. Proposals before 2022 for the Stanislaus forest ran into opposition from private Christmas tree farms and people concerned about damage to the land, according to previous Modesto Bee reporting.","Removal of small trees from the forest will help create a healthier environment over time, according to the government website.","A permit must be purchased and in your possession when cutting and transporting trees. Although the permit is free, the website charges a $2.50 processing fee.","There is a limit of two trees per household. Permits can be reserved beginning Thursday at 7 a.m. on the website, and trees can be cut from Dec. 1 through Dec. 31.","The national land is primarily in eastern Tuolomne County, but extends to parts of Mariposa, Calaveras and Alpine. ","A portion of the forest is available to cut Christmas trees, but not all of it. A map shows the Mokelumne Wilderness, Carson-Iceburg Wilderness and Emigrant Wilderness, among other areas, are off-limits.","Trees must be no more than 20 feet tall, according to the site. Stumps cannot be no more than 12 inches high and six inches in diameter.","Other rules include:","What do you want to know about life in Modesto? Ask our service journalism team your top-of-mind questions in the module below or email servicejournalists@modbee.com.","This story was originally published November 8, 2023, 10:56 AM."]},{"link":"https://www.modbee.com/news/local/crime/article281560058.html#storylink=sectionheadlines","content":["\n             By Trevor Morgan \n            \n        ","A 33-year-old man was killed in a hit-and-run collision on the 3100 block of West Christoffersen Parkway in Turlock at about 5:50 p.m. Monday, according to the Turlock Police Department. ","Responding officers found Shane Hurst, a Turlock resident, lying unresponsive in the center median with “severe head trauma.” Hurst  was then transported to a Turlock hospital, where he died. ","Police are looking for a 2003 to 2009 model, light-colored Hummer H2 described by witnesses as the  vehicle involved in the collision. It was last seen going east on West Christoffersen Parkway immediately after the collision, according to a Police Department statement. ","The incident is being investigated by the Major Accident Investigation Team, which closed the road for nearly six hours. ","“This investigation is a top priority for the Traffic Safety Unit. I ask that anyone who may have information about the identity of the responsible suspect or who may have seen the light colored Hummer, to please contact the Traffic Safety Unit,” read a statement from Officer Michael Simbalenko. ","As investigators examine evidence and review witness statements, police are urging residents to report information regarding the collision to Simbalenko at 209-668-6523. ","Residents can also contact the Turlock Police Department’s Tip Line at 209-668-5550, ext. 6780, or email at tpdtipline@turlock.ca.us.","Anonymous tips can be left with Stanislaus Area Crime Stoppers at 209-521-4636 and may be eligible for a cash reward.","This story was originally published November 7, 2023, 3:42 PM."]},{"link":"https://www.modbee.com/news/local/article281589358.html#storylink=sectionheadlines","content":["\n             By Trevor Morgan \n            \n        ","A bicyclist was killed in a hit-and-run on the 3700 block of McHenry Avenue on Tuesday evening, according to the Modesto Police Department. ","Investigators are asking for the public’s help in looking for a white, or light-colored, 2010 to 2013 model Kia Soul last seen traveling southbound on McHenry Avenue. The vehicle should have had damage to its windshield and passenger side, according to a police statement. ","Police urge anyone who witnessed the collision or has any information regarding it to contact Kyle Johnson at Johnsonk@modestopd.com or Crime Stoppers at 209-521-4636.","Tuesday’s hit-and run is the fifth in Stanislaus county in the past month that resulted in a death and the second in the past 48 hours. ","On Monday, Turlock resident Shane Hurst, 33, was killed on the 3100 block of West Christoffersen Parkway in Turlock. Police are looking for a 2003 to 2009 model, light-colored Hummer H2 described by witnesses as the vehicle involved in the collision. It was last seen going east on West Christoffersen Parkway immediately after the collision.","A 52-year-old Watsonville resident died after being struck by a vehicle near the intersection of Yosemite Boulevard/Highway 132 and Hazeldean Road near Modesto Reservoir on Oct. 31.","Michael Tucker, 44, was struck and killed by a tractor-trailer rig on the 1400 block of East Hatch Road, several hundred feet east of Highway 99.","A 59-year-old man was killed on Oct. 10 while crossing Standiford Avenue in North Modesto. Officers later arrested 21-year-old Isabelle Fernandez on suspicion of gross vehicular manslaughter and driving under the influence. ","Two of these collisions that occurred in Modesto specifically involved bicyclists, with one involving a pedestrian. All of them occurred while they were crossing a roadway in the dark, according to Sharon Bear, spokesperson for Modesto Police. ","Bear stated that just because it was dark doesn’t mean those killed were at fault, but that pedestrians, bicyclists and drivers should take caution once the sun goes down. ","“It is important for bicyclists and pedestrians to assume that cars may not see them and to exercise caution,” wrote Bear in a prepared statement. “Similarly, drivers need to keep their eyes on the road and yield to pedestrians and bicyclists.” ","Modesto has consistently ranked among the worst for traffic crashes among its peer cities across the state in recent years, the Modesto Bee previously reported. ","This story was originally published November 8, 2023, 8:51 AM."]},{"link":"https://www.modbee.com/home-page-carousel/article281356203.html#storylink=sectionheadlines","content":["\n             By Pat Clark \n            \n        ","Two veteran stars of “American Idol,” Ruben Studdard and Clay Aiken, come together for a show at the Gallo Center in Modesto. It’s just one of the entertainment options planned from Nov. 11-17 in the Modesto region.","“Rubin & Clay — Twenty: The Tower” tour features “American Idol” alums Ruben Studdard and Clay Aiken. The two reunite 20 years after their run on the second season of Fox’s “American Idol.” The pair, who became audience favorites, will play a show at the Gallo Center in Modesto.","WHEN: 7:30 p.m. Nov. 16","WHERE: Gallo Center for the Arts, 1000 I St., Modesto","TICKETS: $39-$79","ONLINE: www.galloarts.org","“Beatles vs. Stones – A Musical Showdown” features a pair of tribute bands in concert performing to see which is the greatest. The duel features tribute bands Abbey Road and Satisfaction – The International Rolling Stones Show at the State Theatre in Modesto.","WHEN: 8 p.m. Nov. 14","WHERE: State Theatre, 1307 J St., Modesto","TICKETS: $34-$55","ONLINE: www.thestate.org","Ballet Folklorico Anahuac presents its show Raíces Mexicanas at the Gallo Center in Modesto. The group, “devoted to conserving and promoting the unique Mexican heritage, Ballet Folklórico Anahuac invites you to delight yourself with their annual showcase,” according the Gallo Center website.","WHEN: 6 p.m. Nov. 16","WHERE: Gallo Center for the Arts, 1000 I St., Modesto","TICKETS: $35-$65","ONLINE: www.galloarts.org","The Carnegie Arts Center in Turlock continues its exhibit “Memories & Inspiration: The Kerry and C. Betty Davis Collection of African American Art.” The exhibit currently is on a nationwide tour, organized by International Arts & Artists. It presents 67 works from a collection gathered over 35 years. ","WHEN: 10 a.m.-5 p.m. Tuesdays-Saturdays, through Dec. 30","WHERE: Carnegie Arts Center, 250 N. Broadway, Turlock","ADMISSION: $7","ONLINE: www.carnegieartsturlock.org"]}]